START_MESSAGE_TEXT = (
    "Привет, {user_name}!\nЯ здесь, чтобы помочь с переводами. Просто отправь мне слово"
    ", а затем его перевод. Я запомню эту пару слов и буду использовать ее для "
    "предоставления переводов в будущем. Если у тебя есть еще слова, не стесняйся "
    "добавлять их!📚✨"
)

HELP_MESSAGE_TEXT = (
    "Как использовать этого бота:\n"
    "1. Отправь боту слово, которое ты хочешь перевести.\n"
    "2. На следующем шаге укажи перевод этого слова.\n"
    "3. Укажи свое имя и, при необходимости, фамилию, чтобы мы могли помнить, кто "
    "предоставил переводы.\n"
    "4. Подтверди всю предыдущую информацию, которую ты отправил(а)."
)
