START_MESSAGE_TEXT = (
    "Привет, {user_name}!\nЯ здесь, чтобы помочь с переводами. Просто отправь мне слово"
    ", а затем его перевод. Я запомню эту пару слов и буду использовать ее для "
    "предоставления переводов в будущем. Если у тебя есть еще слова, не стесняйся "
    "добавлять их!📚✨"
)

FIRST_WORD_TEXT = "Вы начали процесс добавление перевода.\nВводите слово:"

SECOND_WORD_TEXT = "Спасибо, теперь вводите перевод"

NAME_INPUT_TEXT = "Спасибо, теперь отправьте Ваше имя (можно имя и фамилию)"

ALL_USER_DATA_TEXT = (
    "Ваше имя сохранено, проверьте введенные данные.\n"
    "Первое слово: <b><i>{first_word}</i></b>;\n"
    "Второе слово: <b><i>{second_word}</i></b>;\n"
    "Ваше имя: <b><i>{user_name}</i></b>\n"
)

HELP_MESSAGE_TEXT = (
    "Как использовать этого бота:\n"
    "1. Отправь боту слово, которое ты хочешь перевести.\n"
    "2. На следующем шаге укажи перевод этого слова.\n"
    "3. Укажи свое имя и, при необходимости, фамилию, чтобы мы могли помнить, кто "
    "предоставил переводы.\n"
    "4. Подтверди всю предыдущую информацию, которую ты отправил(а)."
)

ACCEPT_DATA_TEXT = (
    "Данные сохранены! Спасибо, что помогаете развивать словарь. Хотите предложить "
    "еще один перевод?"
)

NOT_VALID_TEXT = "Допускается ввод в кириллице"

DECLINE_DATA_TEXT = "Ваш перевод был отменен. Хотите предложить новый перевод?"
